% 灰色预测模型 GM(1,n)
%% 输入数据
% A_0为 系统特征数据
A_0=[560823,542386,604834,591248,583031,640636,575688,689637,570790,519574,614677];
% X_0为 相关因素数据
X_0=[104,101.8,105.8,111.5,115.97,120.03,113.3,116.4,105.1,83.4,73.3;
    135.6,140.2,140.1,146.9,144,143,133.3,135.7,125.8,98.5,99.8;
    131.6,135.5,142.6,143.2,142.2,138.4,138.4,135,122.5,87.2,96.5;
    54.2,54.9,54.8,56.3,54.5,54.6,54.9,54.8,49.3,41.5,48.9];
% T为 要往后预测的个数
T = 5;
%% 数据预处理及初始化常用值
X_0 = [A_0;X_0];
[N,M] = size(X_0);
%% 累加生成
A_1 = zeros(M);     % 初始化变量A_1
for i = 1:M
    A_1(i) = sum(A_0(1:i));
end
X_1 = zeros(N,M);   % 初始化变量X_1
for i = 1:N
    for j = 1:M
        X_1(i,j) = sum(X_0(i,1:j));
    end
end
%% 构造矩阵L和数据矩阵Y
Y = X_0(:,2:end)';
L = ones(M - 1, N + 1);
for i = 1:N
    for j = 1:M - 1
        L(j,i) = 0.5 * ( X_1(i,j) + X_1(i,j+1) );
    end
end
%% 计算得到矩阵A、B
H = L\Y;
A = H(1:N,:)';
B = H(N+1,:)';
%% 计算预测数据
YC_1 = X_1(:,1);
for i = 2:M + T
    G = expmdemo2( A*(i - 1) )*YC_1(:,1) + inv(A)*(expmdemo2( A*(i - 1) ) - eye(size(expmdemo2( A*(i - 1)))))*B;
    YC_1 = [YC_1  G];
end
%% 还原预测结果
YC_0 = YC_1(:,1);
for i = 2:M + T
    G = YC_1(:,i) - YC_1(:,i-1);
    YC_0 = [YC_0 G];
end
%% 绘制曲线图
plot(A_0,'r');                         % 原始数据折线图
hold on;
plot(A_0,'r*');                        % 原始数据为红星
hold on;
plot(YC_0(1,:),'b');                   % 预测数据折线图
hold on;
plot(YC_0(1,:),'bo');                  % 预测数据为蓝圈